emacs_dired.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-01-28 Sat 01:48 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs - Dired</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs - Dired</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org44cf6ad">Introduction</a></li>
<li><a href="#orgb4be7af">Enter dired buffer</a></li>
<li><a href="#org31e3574">Navigation</a></li>
<li><a href="#org8ece8cd">Marking &amp; unmarking</a></li>
<li><a href="#org3671a41">Operations</a></li>
<li><a href="#org1156cb8">Working across directories</a></li>
</ul>
</div>
</div>

<div id="outline-container-org44cf6ad" class="outline-2">
<h2 id="org44cf6ad">Introduction</h2>
<div class="outline-text-2" id="text-org44cf6ad">
<p>
Aside from editing files, including local and remote ones, Emacs can also play the role of a file manager, i.e., manipulating directories and the files by its directory editor, <i>dired</i>.
</p>
</div>
</div>
<div id="outline-container-orgb4be7af" class="outline-2">
<h2 id="orgb4be7af">Enter dired buffer</h2>
<div class="outline-text-2" id="text-orgb4be7af">
<p>
Dired can be entered in following ways:
</p>
<ul class="org-ul">
<li>Command: <code>M-x dired</code></li>
<li>Key bindings
<ul class="org-ul">
<li><code>C-x d</code> is equivalent to the command above.</li>
<li><code>C-x 4 d</code> open a dired buffer in another window.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org31e3574" class="outline-2">
<h2 id="org31e3574">Navigation</h2>
<div class="outline-text-2" id="text-org31e3574">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>^</code></td>
<td class="org-left">Go up one directory</td>
</tr>

<tr>
<td class="org-left"><code>n/C-n</code></td>
<td class="org-left">Move the point down an entry</td>
</tr>

<tr>
<td class="org-left"><code>p/C-p</code></td>
<td class="org-left">Move the point up an entry</td>
</tr>

<tr>
<td class="org-left"><code>q</code></td>
<td class="org-left">Quit dired</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8ece8cd" class="outline-2">
<h2 id="org8ece8cd">Marking &amp; unmarking</h2>
<div class="outline-text-2" id="text-org8ece8cd">
<p>
Marking and unmarking enable operations on multiple files or directories.
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>m</code></td>
<td class="org-left">Mark the active entry or the selected region</td>
</tr>

<tr>
<td class="org-left"><code>u</code></td>
<td class="org-left">Unmark the active entry or the selected region</td>
</tr>

<tr>
<td class="org-left"><code>U</code></td>
<td class="org-left">Unmark everything</td>
</tr>

<tr>
<td class="org-left"><code>d</code></td>
<td class="org-left">Flag for deletion</td>
</tr>

<tr>
<td class="org-left"><code>t</code></td>
<td class="org-left">Toggle existing marking</td>
</tr>

<tr>
<td class="org-left"><code>* %</code></td>
<td class="org-left">Mark files and directories by regexp</td>
</tr>

<tr>
<td class="org-left"><code>* c</code></td>
<td class="org-left">Change marks</td>
</tr>

<tr>
<td class="org-left"><code>~</code></td>
<td class="org-left">Mark backup files</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org3671a41" class="outline-2">
<h2 id="org3671a41">Operations</h2>
<div class="outline-text-2" id="text-org3671a41">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>f/RET</code></td>
<td class="org-left">Visit the file/directory</td>
</tr>

<tr>
<td class="org-left"><code>v</code></td>
<td class="org-left">View the file/directory in read-only mode</td>
</tr>

<tr>
<td class="org-left"><code>g</code></td>
<td class="org-left">Refresh dired buffer</td>
</tr>

<tr>
<td class="org-left"><code>+</code></td>
<td class="org-left">Create a directory</td>
</tr>

<tr>
<td class="org-left"><code>C</code></td>
<td class="org-left">Copy marked files/directories</td>
</tr>

<tr>
<td class="org-left"><code>R</code></td>
<td class="org-left">Rename/move marked files/directories</td>
</tr>

<tr>
<td class="org-left"><code>O</code></td>
<td class="org-left">Perform <code>chown</code> on marked files/directories</td>
</tr>

<tr>
<td class="org-left"><code>G</code></td>
<td class="org-left">Perform <code>chgrp</code> on marked files/directories</td>
</tr>

<tr>
<td class="org-left"><code>M</code></td>
<td class="org-left">Perform <code>chmod</code> on marked files/directories</td>
</tr>

<tr>
<td class="org-left"><code>D</code></td>
<td class="org-left">Delete marked files/directories</td>
</tr>

<tr>
<td class="org-left"><code>x</code></td>
<td class="org-left">Delete <i>flagged</i> (marked by <code>d</code>) files/directories</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org1156cb8" class="outline-2">
<h2 id="org1156cb8">Working across directories</h2>
<div class="outline-text-2" id="text-org1156cb8">
<p>
In dired buffer, typing <code>i</code> on a directory will insert it in the same dired buffer as a sub-directory.
</p>

<p>
By inserting multiple directories into a shared dired buffer, you can not only glance at multiple directories simultaneously but you can also work across them as if they were one large virtual directory.
</p>
</div>
</div>
</div>
</body>
</html>